app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "articles" SET "image_updated_at" = ?, "updated_at" = ?, "image_file_name" = ? WHERE "articles"."id" = ?  [["image_updated_at", 2017-01-15 03:53:10 UTC], ["updated_at", 2017-01-15 03:53:10 UTC], ["image_file_name", "banana.png"], ["id", 15]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params)